org/roam/sonarr.org
:PROPERTIES:
:ID:       6e900762-6a77-4abd-b93b-c9a6aad61f71
:END:
#+title: sonarr
#+OPTIONS: toc:nil num:nil date:nil \n:nil html-style:nil author:nil timestamp:nil title:nil html-postamble:nil html5-fancy:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-default.css" />
#+HTML_CONTENT_CLASS: container content
#+HTML_DOCTYPE: html5
#+INCLUDE: "css.org::navbar" :only-contents t
* sonarr
** notes
- TV show calendar, planner and downloader
- uses download client such as transmission/getnzb
  - Downloads to a downloads folder and hard links to media folder
    - support for renaming files on download
    - scans media library and fills in missing shows
      - can manually import seasons/episodes
- limited support for indexers without jackett or [[id:6d09ecdd-b84f-4928-95bb-fbe5c58c2233][prowlarr]]
- tags are used to limit which indexer are used and in release profiles to include/exclude words
- BUG linuxserver docker images do not support --user option (podman userspace containers) and user PUIG/GUID will incorrectly map forcing global permissions of some of the directories to be set
- [[id:90cf48a5-3b01-4667-b100-72acea67034f][podman]] run configuration
#+NAME: sonarr
#+BEGIN_SRC shell :tangle no
podman run \
  --detach \
  --name mysonarr \
  --publish 8989:8989/tcp \
  --rm \
  -e TZ=America/New_York \
  -e PUID=1000 \
  -e PGID=1000 \
  --volume /storage/arr-downloads:/storage/arr-downloads:rshared,rbind \
  --volume /home/jam/Shows:/home/jam/Shows:rshared,rbind \
  --volume /storage/sonarr-config:/config:Z \
  docker.io/linuxserver/sonarr:3.0.8
#+END_SRC
